Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: You can also adjust adaptation on a per-dialog basis by calling wxDialog::SetLayoutAdaptationMode with one of wxDIALOG_ADAPTATION_MODE_DEFAULT (use the global setting), wxDIALOG_ADAPTATION_MODE_ENABLED or wxDIALOG_ADAPTATION_MODE_DISABLED.
ja: また、ダイアログごとに適応を行なうかどうかを指定する場合は wxDialog::SetLayoutAdaptationMode に wxDIALOG_ADAPTATION_MODE_DEFAULT (グローバルな設定を使用)、 wxDIALOG_ADAPTATION_MODE_ENABLED、 wxDIALOG_ADAPTATION_MODE_DISABLED のいずれかを指定します。

source: You can also derive your own class for your own custom encoding and use it, should you need it.
ja: 必要であれば、独自のエンコーディング用に継承クラスを作成して使用することも可能です。

source: You can also override wxDialog::CanDoLayoutAdaptation and wxDialog::DoLayoutAdaptation in a class derived from wxDialog.
ja: また、wxDialog を継承したクラスで wxDialog::CanDoLayoutAdaptation と wxDialog::DoLayoutAdaptation をオーバライドすることも可能です。

source: You can also redirect the wxLogXXX calls to cout by just writing:
ja: 以下のように書くことで wxLogXXX 呼び出しを cout へリダイレクトすることもできます:

source: You can also use DECLARE_APP(appClass) in a header file to declare the wxGetApp function which returns a reference to the application object.
ja: また、ヘッダファイル内で DECLARE_APP(appClass) を使用することで、アプリケーションオブジェクトへの参照を返却する wxGetApp 関数を宣言できます。

source: You can derive a new class from wxEvtHandler instead, defining the appropriate event table, and then call wxWindow::SetEventHandler (or, preferably, wxWindow::PushEventHandler) to make this event handler the object that responds to events.
ja: 代わりに wxEvtHandler を継承した新しいクラスを作成して適切なイベントテーブルを定義し、wxWindow::SetEventHandler (か、より望ましくは wxWindow::PushEventHandler) を呼び出してこのイベントテーブルを使用するようにできます。

source: You can derive your own class from wxDialogLayoutAdapter or wxStandardDialogLayoutAdapter and call wxDialog::SetLayoutAdapter, deleting the old object that this function returns.
ja: wxDialogLayoutAdapter か wxStandardDialogLayoutAdapter を継承した独自のクラスを作成することができます。その場合、wxDialog::SetLayoutAdapter を呼び出し、返却されてきた古いオブジェクトは削除します。

source: You can do checking to see if your application can be safely exited at this point, either from within your close event handler, or from within your exit menu command handler.
ja: このときにアプリケーションを安全に終了できるかどうかを自前の終了イベントハンドラ、もしくは終了メニューコマンドハンドラから確認することができます。

source: You can either choose a single approach that you find preferable or freely combine both methods in your program in different classes or even in one and the same class, although this is probably sufficiently confusing to be a bad idea.
ja: より適切と思ういずれかの方法を選択することもできますし、(おそらく混乱を招く、悪い考えでしょうが) 異なるクラスや同じクラス内で自由に両方の方法を組み合わせることもできます。

source: You can grab all the input for an existing dialog box, and edit it 'in situ', before restoring its behaviour to normal.
ja: その場合、既存のダイアログの振る舞いを元に戻す前にすべての入力を取得し、"その場で" 編集することができます。

source: You can help make sure that your dialogs will continue to function after adaptation by:
ja: 次のようにすることで、適応の実施後もダイアログが引き続き正常に動作するようにできます:

source: You can hide controls contained in sizers the same way you would hide any control, using the wxWindow::Show method.
ja: wxWindow::Show を用いて任意のコントロールを非表示にするのと同じ方法で、サイザー内のコントロールを非表示にすることができます。

source: You can however safely assume that GUI is (already/still) available when your log target as used as wxWidgets automatically switches to using wxLogStderr if it isn't.
ja: しかし、ログターゲットを使用するときに (すでに/まだ) GUI が存在すると安全に仮定することができます。なぜなら、 GUI が存在しない場合は wxLogStderr を使用するように wxWidgets がログターゲットを自動的に切り替えるためです。

source: You can ignore the value parameter of the DECLARE_EVENT_TYPE macro since it used only for backwards compatibility with wxWidgets 2.0.x based applications where you have to give the event type ID an explicit value.
ja: DECLARE_EVENT_TYPE の value 引数はイベント ID を明示的に指定していた wxWidgets 2.0.x との後方互換性のために使用されているだけなので、無視することができます。

source: You can not store binary data, for example.
ja: 例えば、バイナリデータを格納することはできません。

source: You can optionally define event handlers for the validator, to implement filtering.
ja: イベントのフィルタリングを行なうためにバリデータ用のイベントハンドラを任意に定義することができます。

source: You can set WXPREFIX if you are for example distributing a binary version of an application and you don't know in advance where it will be installed.
ja: 例えば、アプリケーションのバイナリを配布するときにどこへインストールされるか分からないような場合に WXPREFIX を設定することができます。

source: You can simply call wxWindow::Close on the frame.
ja: フレームの wxWindow::Close を単純に呼ぶことができます。

source: You can skip the first two sections if you're already familiar with Unicode and wish to jump directly in the details of its support in the library:
ja: すでに Unicode について詳しい場合、最初の 2 つの章は飛ばして、直接ライブラリの対応内容の詳細に飛んでください。

source: You can use wxDialog::AddMainButtonId to add identifiers for buttons that should also be treated as standard buttons for the non-scrolling area.
ja: wxDialog::AddMainButtonId を使用することで非スクロール領域にする標準ボタンとして扱う識別子を追加することができます。

source: You can use wxMBConv Overview and wxFontMapper to display text:
ja: テキストを表示するのに wxMBConv の概要 と wxFontMapper を使用できます:

source: You can use wxMBConv classes and wxFontMapper to display text:
ja: テキストを表示するのに wxMBConv クラス と wxFontMapper を使用できます:

source: You can use wxCSConv class to convert data to the encoding used by the system your application is running on (see wxLocale::GetSystemEncoding).
ja: wxCSConv クラスを使用することで、アプリケーションを実行しているシステムで使用されているエンコーディングにデータを変換することができます。(wxLocale::GetSystemEncoding 参照)

source: You can use wxCSConv to convert data to the encoding used by the system your application is running on (see wxLocale::GetSystemEncoding).
ja: wxCSConv を使用することで、アプリケーションを実行しているシステムで使用されているエンコーディングにデータを変換することができます。(wxLocale::GetSystemEncoding 参照)

source: You can use a stock validator, such as wxTextValidator (which does text control data transfer, validation and filtering) and wxGenericValidator (which does data transfer for a range of controls); or you can write your own.
ja: wxTextValidator (テキストデータの転送、検証、フィルタリングを行います) や wxGenericValidator (複数のコントロールへデータを転送します) といった既存のバリデータを使用することもできますし、自分で作成することもできます。

source: You can use these predefined objects directly, or you can instantiate your own objects.
ja: これらの事前定義されたオブジェクトを直接使用することもできますし、それとは別にインスタンス化することもできます。

source: You can use wxID_HIGHEST to determine the number above which it is safe to define your own identifiers.
ja: 新たな識別子を定義する場合、wxID_HIGHEST 以上の値を使用することで安全に値を決定することができます。

source: You cannot store binary data, for example.
ja: 例えば、バイナリデータを格納することはできません。

source: You could be sending data over a network, or processing a text file for some other application.
ja: これはネットワーク越しにデータを送信する場合や他のアプリケーションで扱うテキストファイルを処理する場合です。

source: You have to fill in proper charset information.
ja: ここに適切な文字コードの情報を記入する必要があります。

source: You may also force the conversion to char or wchar_t by using an explicit cast but beware that converting the value to char uses the conversion to current locale and may return 0 if it fails.
ja: もしくは、明示的なキャストを用いて強制的に char か wchar_t へ変換することもできますが、 char 型への変換は現在のロケールに対して行われ、変換に失敗した場合は 0 が返却されることに注意してください。

source: You may give some custom UI feedback during the drag and drop operation by overriding this function...
ja: この関数をオーバーライドすることで、ドラッグ・アンド・ドロップ中に独自の UI フィードバックを提供することができます。

source: You may include the XPM inline as below, since it's C code, or you can load it at run-time.
ja: XPM は C のコードであるため、以下のようにして XPM をインラインでインクルードしたり、実行時に読み込むことが可能です。

source: You may try setting it to greater amount (say twice nLen) or to 0 (to see performance degradation which will follow) and analyse the impact of it on your program.
ja: この値を大きく (ここでは nLen の倍にしたとしましょう) したり、(性能の劣化具合を確認するために) 0 に設定したりしてプログラムに与える影響を分析しようとするかもしれません。

source: You may use the wxID_OK identifier, for example, on any number of dialogs as long as you don't have several within the same dialog.
ja: 例えば、同じダイアログ内で複数回使うのでなければ、いくつものダイアログで wxID_OK 識別子を使用しても構いません。

source: You may use the wxID_OK identifier, for example, on any number of dialogs so long as you don't have several within the same dialog.
ja: 例えば、同じダイアログ内で複数回使うのでなければ、いくつものダイアログで wxID_OK 識別子を使用しても構いません。

source: You may want to store all program data (created documents etc.) in the same encoding, let's say utf-8.
ja: プログラムで扱うデータ (作成したドキュメントなど) をすべて同じエンコーディングで保持したいと思うかもしれません。仮に utf-8 としましょう。

source: You must derive a class from wxDropTarget and override its pure virtual methods.
ja: また、ドロップ先になるには wxDropTarget を継承し、純粋仮想関数をオーバーライドする必要があります。

source: You must then call Layout on the sizer to force an update.
ja: その後、強制的に更新するためにサイザーの Layout 関数を呼び出す必要があります。

source: You need a way to quickly convert your easily-handled Unicode data to and from a traditional 8-bit encoding.
ja: 取り扱いの簡単な Unicode データと伝統的な 8 ビットエンコーディングとを相互に変換する方法が欲しいと思うでしょう。

source: You only need to make sure that all the HTML files contain the META tag, e.g.
ja: すべての HTML ファイルに次のような META タグを含めて、

source: You only need to make sure that all the HTML files contain the META tag:
ja: 必要なことはすべての HTML ファイルに次のような META タグを含めることだけです。

source: You should also look at the wxThread docs for important notes about secondary threads and their deletion.
ja: また、サブスレッドとその削除に関する注意事項について wxThread のドキュメントも参照してください。

source: You should always use wxICON() and wxBITMAP() macros because they work for any platform (unlike the code above which doesn't deal with wxMac, wxX11, ...) and are shorter and more clear than versions with many #ifdef blocks.
ja: 常に wxICON() マクロと wxBITMAP() マクロを使用するべきです。なぜなら、これらのマクロはどのプラットフォームでも動作しますし (上記のコードは wxMac、wxX11、... に対応していません)、#ifdef を使用したものより簡潔で明確だからです。

source: You should always use wxICON and wxBITMAP macros because they work for any platform (unlike the code above which doesn't deal with wxMac, wxX11, ...) and are more short and clear than versions with #ifdefs.
ja: 常に wxICON マクロと wxBITMAP マクロを使用するべきです。なぜなら、これらのマクロはどのプラットフォームでも動作しますし (上記のコードは wxMac、wxX11、... に対応していません)、#ifdef を使用したものより簡潔で明確だからです。

source: You should define wxUSE_UNICODE to 1 to compile your program in Unicode mode.
ja: プログラムを Unicode モードでコンパイルする場合、 wxUSE_UNICODE を 1 に定義する必要があります。

source: You should delete all wxWidgets object that you created by the time OnExit finishes.
ja: 作成した wxWidgets は OnExit が完了するまでにすべて削除するべきです。

source: You shouldn't pass c_str() result to vararg functions such as standard printf().
ja: c_str() の戻り値を標準 printf() などの可変引数関数へ渡してはいけません。

source: You will find the details about the event table macros and the corresponding wxEvent-derived classes in the discussion of each control generating these events.
ja: イベントテーブルマクロと、それに付随する wxEvent の継承クラスについては、イベントを生成する各コントロールの説明で詳しく説明しています。

source: You will need to change it in your derived renderer class accordingly.
ja: これにあわせて継承クラスを変更する必要があります。

source: You will need to change it in your derived renderer class too if you override it.
ja: この関数をオーバーライドしている場合、継承クラスのシグネチャも変更する必要があります。.

source: You'll have to define and declare a new event type using either way, and this is done using the following macros:
ja: どちらの方法を使うにせよ、新しいイベント型の定義と宣言が必要となりますが、それには以下のマクロを使用します:

source: You're instead encouraged to use wxThreadHelper as it greatly simplifies the communication and the sharing of resources.
ja: 代わりに wxThreadHelper を使用することが奨励されており、このクラスはスレッド間のやり取りとリソースの共有を非常に単純化してくれます。

source: Your .po file may look like this after doing so:
ja: これを行ったあとの .po ファイルはこのようになります:

source: Your application can either use wxWindow::Close event just as the framework does, or it can call wxWindow::Destroy directly.
ja: アプリケーションではフレームワークが行なうように wxWindow::Close イベントを使用するか、もしくは直接 wxWindow::Destroy を呼び出すことができます。

source: and that the hhp project file contains one additional line in the OPTIONS section:
ja: hhp プロジェクトファイルの OPTIONS セクションに一行追加するだけで充分です:

source: and the custom wxServer is required so that a user-overridden wxClient::OnMakeConnection member can return a wxConnection of the required class, when a connection is made.
ja: そして wxServer を継承したクラスが必要になります。これにより、接続が確立したときに wxClient::OnMakeConnection をオーバーライドした関数が要求されたクラスの wxConnection を返却できるようになります。

source: and the somewhat less usual
ja: そして、若干、一般的ではないですが、

source: avoiding the above situations and assumptions;
ja: 上記のような状況や仮定を避ける;

source: because the argument of puts() is known to be of the type const char*, this is not done for printf() which is a function with variable number of arguments (and whose arguments are of unknown types).
ja: なぜなら、puts() の引数が const char * 型であることが分かっているためです。これは (引数が不明な型になる) 可変数引数を受け取る printf() では 行われません 。

source: because the argument of puts() is known to be of the type const char *, this is not done for printf() which is a function with variable number of arguments (and whose arguments are of unknown types).
ja: なぜなら、puts() の引数が const char * 型であることが分かっているためです。これは (引数が不明な型になる) 可変数引数を受け取る printf() では 行われません 。

source: case wxID_CANCEL: // Do nothing - so don't quit app.
ja: case wxID_CANCEL: // 何もしない - そのため、アプリケーションを終了しない

source: case wxID_NO: // Don't save; just destroy, quitting app
ja: case wxID_NO: // 保存しない; 破棄してアプリケーションを終了する

source: case wxID_YES: // Save, then destroy, quitting app
ja: case wxID_YES: // 保存し、アプリケーションを終了する

source: conf.Write("MyFavouriteColour", Red); // ERROR: no match
ja: conf.Write("MyFavouriteColour", Red); // エラー: 一致しない

source: do everything at once but call wxWindow::Update() or wxApp::YieldFor(wxEVT_CATEGORY_UI) periodically to update the screen.
ja: すべての計算を一度に行うが、画面を更新するために wxWindow::Update() か wxApp::YieldFor(wxEVT_CATEGORY_UI) を定期的に呼び出す。

source: does not work because the temporary buffer returned by wxString::ToUTF8() is destroyed and p is left pointing nowhere.
ja: 動作 しません。これは、wxString::ToUTF8() の返却した一時バッファが破棄され、p が存在しないアドレスを指したままになるためです。

source: does not compile when using Microsoft Visual C++ and needs to be changed to use mb_str() (which will not work for file names containing Unicode characters, consider using wxWidgets classes and functions to work with such file names as they are not supported by standard C++ library).
ja: Microsoft Visual C++ を使用するとコンパイルされないため、mb_str() を使用するように変更する必要があります。(mb_str() は Unicode 文字を含むファイル名では動作しません。標準の C++ ライブラリではそのようなフィアル名に対応していないため、これらを取り扱える wxWidgets のクラスと関数を使用することを検討してください)

source: doesn't compile.
ja: これはコンパイルすることができません。

source: doesn't work because the argument of the switch statement must be an integer expression so you need to replace s[n] with
ja: うまく動作しません。なぜなら、switch 文の引数は整数式でなければならないためです。そのため、s[n] を次のように置き換える必要があります。

source: doesn't yield a pointer to char so you may not pass it to functions expecting char* or wchar_t*.
ja: では char 型のポインタを得ることはできないため、これを char* または wchar_t* を受け取る関数に渡すことはできません。

source: event.Veto(); // Notify the calling code that we didn't delete the frame.
ja: event.Veto(); // フレームを削除しなかったことを呼び出し元へ通知する

source: however this doesn't work correctly for strings with embedded NUL characters and the use of iterators is generally preferred as they provide some run-time checks (at least in debug build) unlike the raw pointers.
ja: ただし、これは文字列中に NUL 文字が含まれる場合には正しく動作しません。生ポインタと違い、イテレータを使うといくつかの実行時チェックが (少なくともデバッグビルドでは) 行われるため、一般的にはこちらの方が望ましいです。

source: if (!event.CanVeto()) // Test if we can veto this deletion
ja: if (!event.CanVeto()) // この削除が拒否可能か確認する

source: is not going to work.
ja: これは正常に動作しないでしょう。

source: only making assumptions about hierarchy immediately after the dialog is created;
ja: ダイアログ内の階層構造について仮定するのはダイアログの作成直後だけにする;

source: overriding wxDialog::GetContentWindow to return a book control if your dialog implements pages: wxWidgets will then only make the pages scrollable.
ja: ダイアログでページを実装している場合、ブックコントロールを返却するように wxDialog::GetContentWindow をオーバーライドする: その場合、wxWidgets はページのみをスクロール可能にします。

source: program can't continue, abort immediately
ja: プログラムを継続できないため、ただちに中断します

source: rewrite this overview; it's not up2date with wxString changes
ja: この概要を書き直す; wxString の変更が反映されていない

source: should be rewritten as
ja: これは以下のように書き換えるべきです。

source: somewhere in the class declaration.
ja: クラス宣言内のどこかに挿入する必要があります。

source: switch (result) { case wxDragCopy: /* copy the data */ break; case wxDragMove: /* move the data */ break; default: /* do nothing */ break; }
ja: switch (result) { case wxDragCopy: /* データをコピーする */ break; case wxDragMove: /* データを移動する */ break; default: /* 何もしない */ break; }

source: the "IO" classes: wxSocketIn/OutputStream, wxDataIn/OutputStream, wxFileIn/OutputStream, ...
ja: "IO" クラス: wxSocketIn/OutputStream, wxDataIn/OutputStream, wxFileIn/OutputStream, ...

source: the core: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterIn/OutputStream
ja: コアクラス: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterIn/OutputStream

source: this->Destroy(); // If not, destroy the window anyway.
ja: this->Destroy(); // 拒否不可の場合、とにかくウィンドウを破棄する

source: topsizer->SetSizeHints( this ); // set size hints to honour minimum size }
ja: topsizer->SetSizeHints( this ); // 最小サイズを守るためのサイズヒントを設定する }

source: trace messages are also only enabled in debug mode
ja: トレースメッセージもデバッグモード時のみ有効化されます

source: use wxIdleEvent (e.g. to perform a long calculation while updating a progress dialog)
ja: wxIdleEvent を使用する。(例えば、プログレスダイアログを更新しながら長い計算を行なうために使用します)

source: using wxStdDialogButtonSizer;
ja: wxStdDialogButtonSizer を使用する;

source: using an intermediate sizer under the main sizer, a false top-level sizer that can be relied on to exist for the purposes of manipulating child sizers and windows;
ja: メインのサイザーの下に仲介サイザーを使用する; これは偽のトップレベルサイザーで、子サイザーとウィンドウを操作するために使用します。

source: we call event.Skip() so the
ja: wxWidgets の規定クラスや

source: we don't call event.Skip() so the
ja: このイベントを他の場所で処理することはないため、

source: which does work.
ja: これは正常に動作します。

source: will log the message if it was preceded by:
ja: このメッセージは先に以下の処理を行なっている場合に記録されます:

source: will work exactly as expected.
ja: 期待した通りに動作します。

source: work as expected.
ja: これは期待した通りに動作します。

source: works both with wxWidgets 3.0 and previous library versions and so should be used for writing code which should be compatible with both 2.8 and 3.0.
ja: wxWidgets 3.0 と以前のバージョンの両方で動作します。そのため、2.8 と 3.0 で互換性のあるコードを書かなければならない場合はこのように書くべきです。

source: wouldn't work if the encoding used on the user system is incompatible with ISO-8859-1 (or even if the sources were compiled under different locale in the case of gcc).
ja: これはユーザのシステムが ISO-8859-1 と互換性がない場合 (gcc の場合、別のロケールでコンパイルされたとしても) 、うまく動作しません。

source: wxALIGN_CENTRE (same as wxALIGN_CENTER) is defined as (wxALIGN_CENTER_HORIZONTAL | wxALIGN_CENTER_VERTICAL).
ja: wxALIGN_CENTRE (wxALIGN_CENTER と同じです) は (wxALIGN_CENTER_HORIZONTAL | wxALIGN_CENTER_VERTICAL) として定義されています。

source: wxALIGN_LEFT, wxALIGN_TOP, wxALIGN_RIGHT, wxALIGN_BOTTOM, wxALIGN_CENTER_HORIZONTAL and wxALIGN_CENTER_VERTICAL do what they say.
ja: wxALIGN_LEFT、wxALIGN_TOP、wxALIGN_RIGHT、wxALIGN_BOTTOM、wxALIGN_CENTER_HORIZONTAL、wxALIGN_CENTER_VERTICAL はその名前の通りのことを行います。

source: wxArrayString is an efficient container for storing wxString objects.
ja: wxArrayString は wxString オブジェクトを効率的に格納するためのコンテナです。

source: wxBACKWARD // return wxID_BACKWARD
ja: wxBACKWARD // wxID_BACKWARD を返却します

source: wxCANCEL // return wxID_CANCEL
ja: wxCANCEL // wxID_CANCEL を返却します

source: wxChar is defined to be
ja: wxChar は次のように定義されます。

source: wxCondition variables correspond to pthread conditions or to Win32 event objects.
ja: wxCondition 変数は pthread のコンディションや Win32 のイベントオブジェクトに相当します。

source: wxConfig Overview
ja: wxConfig の概要

source: wxConfigBase defines the basic interface of all config classes.
ja: wxConfigBase はすべてのコンフィグクラスの基本インタフェースを定義します。

source: wxDataViewCustomRenderer::Activate() and wxDataViewCustomRenderer::LeftClick() were replaced with the new wxDataViewCustomRenderer::ActivateCell() method.
ja: wxDataViewCustomRenderer::Activate() と wxDataViewCustomRenderer::LeftClick() は新しい wxDataViewCustomRenderer::ActivateCell() 関数に置き換えられました。

source: wxDir is a portable equivalent of Unix open/read/closedir functions which allow enumerating of the fi...
ja: wxDir は ファイルやディレクトリの列挙を行う Unix の open/read/closedir 関数と同じことを行います。

source: wxDocument::FileHistoryLoad() and wxFileHistory::Load() now take const reference to wxConfigBase argument and not just a reference, please update your code if you overrode these functions and change the functions in the derived classes to use const reference as well.
ja: wxDocument::FileHistoryLoad() と wxFileHistory::Load() は wxConfigBase の単なる参照ではなく、const 参照を受け取るようになりました。そのため、これらの関数をオーバーライドしている場合は const 参照を使用するように継承クラスの関数を変更してください。

source: wxFORWARD // return wxID_FORWARD
ja: wxFORWARD // wxID_FORWARD を返却します

source: wxFTP can be used to establish a connection to an FTP server and perform all the usual operations...
ja: wxFTP は FTP サーバへの接続と、便利な操作すべてを行なうために使用できます。

source: wxFileConfig implements wxConfigBase interface for storing and retrieving configuration information u...
ja: wxFileConfig は wxConfigBase インタフェースを実装しており、プレインテキストファイルを使用して設定情報を格納、取得するためのクラスです。

source: wxFilterIn/OutputStream is the base class definition for stream filtering.
ja: wxFilterIn/OutputStream はフィルタリング用の基底クラスです。

source: wxFontMapper manages user-definable correspondence between logical font names and the fonts present o...
ja: wxFontMapper はユーザが定義可能な論理フォント名とマシン上のフォントとの対応を管理します。

source: wxGenericValidator performs data transfer (but not validation or filtering) for many type of controls...
ja: wxGenericValidator は様々なコントロールへデータを転送します。(しかし、検証やフィルタリングは行いません)

source: wxHELP // return wxID_HELP
ja: wxHELP // wxID_HELP を返却します

source: wxHTTP can be used to establish a connection to an HTTP server.
ja: wxHTTP は HTTP サーバへ接続するために使用できます。

source: wxIcon icon(wxICON(mondrian)); // Equivalent to: #if defined(__WXGTK__) || defined(__WXMOTIF__) wxIcon icon(mondrian_xpm); #endif #if defined(__WXMSW__) wxIcon icon("mondrian"); #endif
ja: wxIcon icon(wxICON(mondrian)); // これは以下と同等: #if defined(__WXGTK__) || defined(__WXMOTIF__) wxIcon icon(mondrian_xpm); #endif #if defined(__WXMSW__) wxIcon icon("mondrian"); #endif

source: wxInputStream and wxOutputStream inherit from it.
ja: wxInputStream と wxOutputStream はこのクラスを継承しています。

source: wxInputStream is an abstract base class which may not be used directly.
ja: wxInputStream は抽象クラスであり、直接使用することはありません。

source: wxListCtrl overview
ja: wxListCtrl の概要

source: wxLocale class encapsulates all language-dependent settings and is a generalization of the C locale c...
ja: wxLocale クラスは C 言語におけるロケールの概念を一般化したものであり、言語に依存するすべての設定をカプセル化します。

source: wxLog class defines the interface for the log targets used by wxWidgets logging functions as explaine...
ja: wxLog クラスは wxWidgets のロギング関数で使用されるログターゲットのインタフェースを定義するクラスです。 詳細は wxLog クラスの概要を参照してください、

source: wxLogBuffer is a very simple implementation of log sink which simply collects all the logged messages...
ja: wxLogBuffer はログ出力先の非常に単純な実装で、すべてのログメッセージを単純に文字列へ集めます。 (ただし、デバッグメッセージは除きます。なぜなら、普通、デバッグメッセージはただちに出力されるので、後で集めることにおそらく関心がないためです)

source: wxLogFormatter class is used to format the log messages.
ja: wxLogFormatter クラスはログメッセージをフォーマットするのに使用されます。

source: wxMBConv Classes
ja: wxMBConv クラス

source: wxMBConv Objects
ja: wxMBConv オブジェクト

source: wxMORE // return wxID_MORE
ja: wxMORE // wxID_MORE を返却します

source: wxNO // return wxID_NO
ja: wxNO // wxID_NO を返却します

source: wxNO_DEFAULT // make the wxNO button the default, otherwise wxYES or wxOK button will be default
ja: wxNO_DEFAULT // wxNO ボタンをデフォルトにします。これを指定しない場合、wxYES ボタンか wxOK ボタンがデフォルトになります

source: wxOK // return wxID_OK
ja: wxOK // wxID_OK を返却します

source: wxOutputStream does the same thing but it is for write-only streams.
ja: wxOutputStream も同じことを行いますが、こちらは書き込み専用のストリーム用です。

source: wxOutputStream is an abstract base class which may not be used directly.
ja: wxOutputStream は抽象クラスであり、直接使用することはありません。

source: wxPlotCurve *curve = event.GetCurve(); } // user code sending the event void MyWindow::SendEvent() {
ja: wxPlotCurve *curve = event.GetCurve(); } // イベントを送信するユーザコード void MyWindow::SendEvent() {

source: wxPropertySheetDialog and wxWizard
ja: wxPropertySheetDialog と wxWizard

source: wxSETUP // return wxID_SETUP
ja: wxSETUP // wxID_SETUP を返却します

source: wxSemaphore is a counter limiting the number of threads concurrently accessing a shared resource...
ja: wxSemaphore は共有リソースへ同時アクセス可能なスレッド数を制限するカウンターです。
